ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/psrm/receiveClaim/ValidWriteDownAnnulPaymentRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <MFFordringIndberet_I xmlns="http://skat.dk/begrebsmodel/2009/01/15/">
            <Kontekst/>
            <FordringhaverSystemIDStruktur>
                <VirksomhedSENummer>62786515</VirksomhedSENummer>
            </FordringhaverSystemIDStruktur>
            <MFLeveranceID>1500467289038</MFLeveranceID>
            <FordringAktionSamling>
                <FordringAktion>
                    <MFAktionKode>NEDSKRIVNINGANNULLERETOPSKRIVNINGINDBETALING</MFAktionKode>
                    <DMIFordringHaverID>1229</DMIFordringHaverID>
                    <AktionValg>
                        <MFNedskrivningAnnulleretOpskrivningIndbetalingStruktur>
                            <DMIFordringEFIFordringID>110000000230</DMIFordringEFIFordringID>
                            <DMIFordringModtagelseDato>2017-07-19T14:26:19.461</DMIFordringModtagelseDato>
                            <MFAktionID>CHANGE_MFAktionID</MFAktionID>
                            <MFAktionIDRef>110000000331</MFAktionIDRef>
                            <EFIKundeIdentStruktur>
                                <IdentValg>
                                    <PersonCPRNummer>0505711092</PersonCPRNummer>
                                </IdentValg>
                            </EFIKundeIdentStruktur>
                            <FordringNedskrivningVirkningFra>2017-07-03</FordringNedskrivningVirkningFra>
                            <FordringNedskrivningÅrsagBegr>FordringNedskrivningÅrsagBegr0</FordringNedskrivningÅrsagBegr>
                            <NedskrivningBeløbStruktur>
                                <ValutaKode>DKK</ValutaKode>
                                <FordringNedskrivningBeløb>500</FordringNedskrivningBeløb>
                            </NedskrivningBeløbStruktur>
                        </MFNedskrivningAnnulleretOpskrivningIndbetalingStruktur>
                    </AktionValg>
                </FordringAktion>
            </FordringAktionSamling>
        </MFFordringIndberet_I>
    </soap:Body>
</soap:Envelope>